{ 
        "id" : "Rasberry_chocolate_cake",
	"name" : "Chocolate Cake",
	"desc" : "This is the cake that will make you a star. It will become your secret weapon for dinner parties and special occasions and you'll never look at another chocolate cake recipe again.",
	"Prep time" : "5 min",
	"Cook time" : "1 hours",
	"Makes" : "1 big cake or 2 smaller cakes",
        "image" : "cake0.jpg",
	"images" : [],
        "tags" : ["cake","chocolate"],
	"reference" : [ {"Chocoloate Ganache" : "????"}],
	"ingredientTypes" : [ {"ingredients" : [
						{"self-raising flour" : "3 cups"},
						{"sugars" : "2 cups"},
						{"vanilla extract" : "1.5 tsp"},
						{"cocoa powder" : "3/4 cups"},
						{"baking soda, sifted" : "2 tsp"},
						{"butter, softened" : "200g"},
						{"self-raising flour" : "3 cups"},
						{"milk or unsweetened yoghurt" : "1 cups"},
						{"large eggs" : "3"},
						{"boiling hot coffee" : "1 cup"} 
					]},
                            {"To ice": [
						{"Chocoloate Ganache":""},
						{"fresh raspberries":""}
					]}
					
					
			],
	 "method" : [ {"normal" : [
		 		"Heat oven to 160°C. Grease the sides and line the base of a 30cm round cake tin or 2 x 20cm round cake tins with baking paper",
		 		"Place all ingredients except Chocolate Ganache and raspberries in a bowl or food processor and mix or blitz until the ingredients are combined and the butter is fully incorporated. Pour mixture into prepared tin or tins and smooth top. Bake for 1 hour or until a skewer inserted into the centre comes out clean. Allow to cool in the tin. If not using at once, the cake will keep for about a week in a sealed container in the fridge. You can also freeze it uniced.",
		 		"When you are ready to ice the cake, slather chilled Chocolate Ganache over the top. Top with fresh raspberries and serve."
	 		]},
	 		{"Variation:" : [
	 			"To make chocolate cupcakes, preheat oven to 160°C and line 24 muffin pans with paper cases. Prepare cake batter according to the instructions for The Ultimate Chocolate Cake (see above). Spoon mixture into the paper cases, filling about two thirds full. Bake for 25-30 minutes. Cool before icing. For icing, beat 200g firm cream cheese with 100g softened butter until smooth. Gradually beat in 2 cups icing sugar until smooth and creamy. Add a few drops of food colouring to get the desired colour. Icing can be stored in the fridge in a sealed container for up to a week. Pipe onto the cakes and top with confectionery sprinkles. Makes 24."
	 		]}
                    ]
	 
	 
}
